Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ2025DAR176.atdf
         <module id="00740" name="ICAP" version="">
           <instance name="ICAP1">
              <parameters>
                 <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                 <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                 <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 5"/>
                 <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 4"/>
              </parameters>
           </instance>
           <instance name="ICAP2">
              <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 5"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 4"/>
              </parameters>
           </instance>
           <instance name="ICAP3">
              <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 5"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 4"/>
              </parameters>
           </instance>
           <instance name="ICAP4">
              <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 2"/>
              </parameters>
           </instance>
           <instance name="ICAP5">
              <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 2"/>
              </parameters>
           </instance>
           <instance name="ICAP6">
              <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 2"/>
              </parameters>
           </instance>
           <instance name="ICAP7">
              <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 7"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 6"/>
              </parameters>
           </instance>
           <instance name="ICAP8">
              <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 7"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 6"/>
              </parameters>
           </instance>
           <instance name="ICAP9">
              <register-group address-space="periph_pb3_std" name="ICAP" name-in-module="ICAP" offset="0x1f842000"/>
              <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 7"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 6"/>
              </parameters>
           </instance>
         </module>
         <module id="02907" name="INT" version="">
            <instance name="INT">
               <register-group address-space="periph_pb1_fast" name="INT" name-in-module="INT" offset="0x1f810000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02869" name="JTAG" version="">
            <instance name="JTAG">
               <register-group address-space="periph_pb1_std" name="JTAG" name-in-module="JTAG" offset="0x1f801130" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02819" name="NVM" version="">
            <instance name="NVM">
               <register-group address-space="periph_pb1_std" name="NVM" name-in-module="NVM" offset="0x1f800600" />
               <parameters>
                  <param name="PAGE_SIZE" value="16384"/>
                  <param name="ROW_SIZE" value="2048"/>
               </parameters>
            </instance>
         </module>
         <module id="00749" name="OCMP" version="">
            <instance name="OCMP1">
                <register-group address-space="periph_pb3_std" name="OCMP" name-in-module="OCMP" offset="0x1f844000"/>
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 4"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 5"/>
                 </parameters>
            </instance>
            <instance name="OCMP2">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 4"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 5"/>
                 </parameters>
            </instance>
