Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ2025DAR176.atdf
         <register caption="ADC Digital Comparator x Limit Value Register (x = 1 through 6)" name="ADCCMP6" offset="0x64" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DCMPLO" />
            <bitfield mask="0xFFFF0000" name="DCMPHI" />
         </register>
         <register caption="ADC Digital Filter x Register (x = 1 through 6)" name="ADCFLTR1" offset="0x68" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="FLTRDATA" />
            <bitfield caption="Digital Filter Analog Input Selection bits" mask="0x001F0000" name="CHNLID" values="ADCFLTR1__CHNLID" />
            <bitfield caption="Digital Filter x Data Ready Status bit" mask="0x01000000" name="AFRDY" values="ADCFLTR1__AFRDY" />
            <bitfield caption="Digital Filter x Interrupt Enable bit" mask="0x02000000" name="AFGIEN" values="ADCFLTR1__AFGIEN" />
            <bitfield caption="Oversampling Filter Ratio bits" mask="0x1C000000" name="OVRSAM" values="ADCFLTR1__OVRSAM" />
            <bitfield caption="ADC Filter Mode bit" mask="0x20000000" name="DFMODE" values="ADCFLTR1__DFMODE" />
            <bitfield caption="Filter Significant Data Length bit" mask="0x40000000" name="DATA16EN" values="ADCFLTR1__DATA16EN" />
            <bitfield caption="Digital Filter x Enable bit" mask="0x80000000" name="AFEN" values="ADCFLTR1__AFEN" />
         </register>
         <register caption="ADC Digital Filter x Register (x = 1 through 6)" name="ADCFLTR2" offset="0x6c" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="FLTRDATA" />
            <bitfield caption="Digital Filter Analog Input Selection bits" mask="0x001F0000" name="CHNLID" values="ADCFLTR2__CHNLID" />
            <bitfield caption="Digital Filter x Data Ready Status bit" mask="0x01000000" name="AFRDY" values="ADCFLTR2__AFRDY" />
            <bitfield caption="Digital Filter x Interrupt Enable bit" mask="0x02000000" name="AFGIEN" values="ADCFLTR2__AFGIEN" />
            <bitfield caption="Oversampling Filter Ratio bits" mask="0x1C000000" name="OVRSAM" values="ADCFLTR2__OVRSAM" />
            <bitfield caption="ADC Filter Mode bit" mask="0x20000000" name="DFMODE" values="ADCFLTR2__DFMODE" />
            <bitfield caption="Filter Significant Data Length bit" mask="0x40000000" name="DATA16EN" values="ADCFLTR2__DATA16EN" />
            <bitfield caption="Digital Filter x Enable bit" mask="0x80000000" name="AFEN" values="ADCFLTR2__AFEN" />
         </register>
         <register caption="ADC Digital Filter x Register (x = 1 through 6)" name="ADCFLTR3" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="FLTRDATA" />
            <bitfield caption="Digital Filter Analog Input Selection bits" mask="0x001F0000" name="CHNLID" values="ADCFLTR3__CHNLID" />
            <bitfield caption="Digital Filter x Data Ready Status bit" mask="0x01000000" name="AFRDY" values="ADCFLTR3__AFRDY" />
            <bitfield caption="Digital Filter x Interrupt Enable bit" mask="0x02000000" name="AFGIEN" values="ADCFLTR3__AFGIEN" />
            <bitfield caption="Oversampling Filter Ratio bits" mask="0x1C000000" name="OVRSAM" values="ADCFLTR3__OVRSAM" />
            <bitfield caption="ADC Filter Mode bit" mask="0x20000000" name="DFMODE" values="ADCFLTR3__DFMODE" />
            <bitfield caption="Filter Significant Data Length bit" mask="0x40000000" name="DATA16EN" values="ADCFLTR3__DATA16EN" />
            <bitfield caption="Digital Filter x Enable bit" mask="0x80000000" name="AFEN" values="ADCFLTR3__AFEN" />
         </register>
         <register caption="ADC Digital Filter x Register (x = 1 through 6)" name="ADCFLTR4" offset="0x74" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="FLTRDATA" />
            <bitfield caption="Digital Filter Analog Input Selection bits" mask="0x001F0000" name="CHNLID" values="ADCFLTR4__CHNLID" />
            <bitfield caption="Digital Filter x Data Ready Status bit" mask="0x01000000" name="AFRDY" values="ADCFLTR4__AFRDY" />
            <bitfield caption="Digital Filter x Interrupt Enable bit" mask="0x02000000" name="AFGIEN" values="ADCFLTR4__AFGIEN" />
            <bitfield caption="Oversampling Filter Ratio bits" mask="0x1C000000" name="OVRSAM" values="ADCFLTR4__OVRSAM" />
            <bitfield caption="ADC Filter Mode bit" mask="0x20000000" name="DFMODE" values="ADCFLTR4__DFMODE" />
            <bitfield caption="Filter Significant Data Length bit" mask="0x40000000" name="DATA16EN" values="ADCFLTR4__DATA16EN" />
            <bitfield caption="Digital Filter x Enable bit" mask="0x80000000" name="AFEN" values="ADCFLTR4__AFEN" />
         </register>
         <register caption="ADC Digital Filter x Register (x = 1 through 6)" name="ADCFLTR5" offset="0x78" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="FLTRDATA" />
            <bitfield caption="Digital Filter Analog Input Selection bits" mask="0x001F0000" name="CHNLID" values="ADCFLTR5__CHNLID" />
            <bitfield caption="Digital Filter x Data Ready Status bit" mask="0x01000000" name="AFRDY" values="ADCFLTR5__AFRDY" />
            <bitfield caption="Digital Filter x Interrupt Enable bit" mask="0x02000000" name="AFGIEN" values="ADCFLTR5__AFGIEN" />
            <bitfield caption="Oversampling Filter Ratio bits" mask="0x1C000000" name="OVRSAM" values="ADCFLTR5__OVRSAM" />
            <bitfield caption="ADC Filter Mode bit" mask="0x20000000" name="DFMODE" values="ADCFLTR5__DFMODE" />
            <bitfield caption="Filter Significant Data Length bit" mask="0x40000000" name="DATA16EN" values="ADCFLTR5__DATA16EN" />
            <bitfield caption="Digital Filter x Enable bit" mask="0x80000000" name="AFEN" values="ADCFLTR5__AFEN" />
         </register>
         <register caption="ADC Digital Filter x Register (x = 1 through 6)" name="ADCFLTR6" offset="0x7c" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="FLTRDATA" />
            <bitfield caption="Digital Filter Analog Input Selection bits" mask="0x001F0000" name="CHNLID" values="ADCFLTR6__CHNLID" />
            <bitfield caption="Digital Filter x Data Ready Status bit" mask="0x01000000" name="AFRDY" values="ADCFLTR6__AFRDY" />
            <bitfield caption="Digital Filter x Interrupt Enable bit" mask="0x02000000" name="AFGIEN" values="ADCFLTR6__AFGIEN" />
            <bitfield caption="Oversampling Filter Ratio bits" mask="0x1C000000" name="OVRSAM" values="ADCFLTR6__OVRSAM" />
            <bitfield caption="ADC Filter Mode bit" mask="0x20000000" name="DFMODE" values="ADCFLTR6__DFMODE" />
            <bitfield caption="Filter Significant Data Length bit" mask="0x40000000" name="DATA16EN" values="ADCFLTR6__DATA16EN" />
            <bitfield caption="Digital Filter x Enable bit" mask="0x80000000" name="AFEN" values="ADCFLTR6__AFEN" />
         </register>
         <register caption="ADC Trigger Source 1 Register" name="ADCTRG1" offset="0x80" rw="RW" size="4">
            <bitfield caption="Trigger Source for Conversion of Analog Input AN0 Select bits" mask="0x0000001F" name="TRGSRC0" values="ADCTRG1__TRGSRC0" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN1 Select bits" mask="0x00001F00" name="TRGSRC1" values="ADCTRG1__TRGSRC1" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN2 Select" mask="0x001F0000" name="TRGSRC2" values="ADCTRG1__TRGSRC2" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN3 Select bits" mask="0x1F000000" name="TRGSRC3" values="ADCTRG1__TRGSRC3" />
         </register>
         <register caption="ADC Trigger Source 2 Register" name="ADCTRG2" offset="0x84" rw="RW" size="4">
            <bitfield caption="Trigger Source for Conversion of Analog Input AN4 Select bits" mask="0x0000001F" name="TRGSRC4" values="ADCTRG2__TRGSRC4" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN5 Select bits" mask="0x00001F00" name="TRGSRC5" values="ADCTRG2__TRGSRC5" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN6 Select bits" mask="0x001F0000" name="TRGSRC6" values="ADCTRG2__TRGSRC6" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN7 Select bits" mask="0x1F000000" name="TRGSRC7" values="ADCTRG2__TRGSRC7" />
         </register>
         <register caption="ADC Trigger Source 3 Register" name="ADCTRG3" offset="0x88" rw="RW" size="4">
            <bitfield caption="Trigger Source for Conversion of Analog Input AN8 Select bits" mask="0x0000001F" name="TRGSRC8" values="ADCTRG3__TRGSRC8" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN9 Select bits" mask="0x00001F00" name="TRGSRC9" values="ADCTRG3__TRGSRC9" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN10 Select bits" mask="0x001F0000" name="TRGSRC10" values="ADCTRG3__TRGSRC10" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN11 Select bits" mask="0x1F000000" name="TRGSRC11" values="ADCTRG3__TRGSRC11" />
         </register>
         <register caption="ADC Digital Comparator 1 Control Register" name="ADCCMPCON1" offset="0xa0" rw="RW" size="4">
            <bitfield caption="Low/Low Digital Comparator 0 Event bit" mask="0x00000001" name="IELOLO" values="ADCCMPCON1__IELOLO" />
            <bitfield caption="Low/High Digital Comparator 0 Event bit" mask="0x00000002" name="IELOHI" values="ADCCMPCON1__IELOHI" />
            <bitfield caption="High/Low Digital Comparator 0 Event bit" mask="0x00000004" name="IEHILO" values="ADCCMPCON1__IEHILO" />
            <bitfield caption="High/High Digital Comparator 0 Event bit" mask="0x00000008" name="IEHIHI" values="ADCCMPCON1__IEHIHI" />
            <bitfield caption="Between Low/High Digital Comparator 0 Event bit" mask="0x00000010" name="IEBTWN" values="ADCCMPCON1__IEBTWN" />
            <bitfield caption="Digital Comparator 0 Output True Event Status bit" mask="0x00000020" name="DCMPED" values="ADCCMPCON1__DCMPED" />
            <bitfield caption="Digital Comparator 0 Global Interrupt Enable bit" mask="0x00000040" name="DCMPGIEN" values="ADCCMPCON1__DCMPGIEN" />
            <bitfield caption="Digital Comparator 0 Enable bit" mask="0x00000080" name="ENDCMP" values="ADCCMPCON1__ENDCMP" />
            <bitfield caption="Digital Comparator 0 Analog Input Identification bits" mask="0x00003F00" name="AINID" values="ADCCMPCON1__AINID" />
            <bitfield mask="0xFFFF0000" name="CVDDATA" />
         </register>
         <register caption="ADC Digital Comparator x Control Register (x = 2 through 6)" name="ADCCMPCON2" offset="0xa4" rw="RW" size="4">
            <bitfield caption="Low/Low Digital Comparator x Event bit" mask="0x00000001" name="IELOLO" values="ADCCMPCON2__IELOLO" />
            <bitfield caption="Low/High Digital Comparator x Event bit" mask="0x00000002" name="IELOHI" values="ADCCMPCON2__IELOHI" />
            <bitfield caption="High/Low Digital Comparator x Event bit" mask="0x00000004" name="IEHILO" values="ADCCMPCON2__IEHILO" />
            <bitfield caption="High/High Digital Comparator x Event bit" mask="0x00000008" name="IEHIHI" values="ADCCMPCON2__IEHIHI" />
            <bitfield caption="Between Low/High Digital Comparator x Event bit" mask="0x00000010" name="IEBTWN" values="ADCCMPCON2__IEBTWN" />
            <bitfield caption="Digital Comparator x Output True Event Status bit" mask="0x00000020" name="DCMPED" values="ADCCMPCON2__DCMPED" />
            <bitfield caption="Digital Comparator x Global Interrupt Enable bit" mask="0x00000040" name="DCMPGIEN" values="ADCCMPCON2__DCMPGIEN" />
            <bitfield caption="Digital Comparator x Enable bit" mask="0x00000080" name="ENDCMP" values="ADCCMPCON2__ENDCMP" />
            <bitfield caption="Digital Comparator x Analog Input Identification bits" mask="0x00001F00" name="AINID" values="ADCCMPCON2__AINID" />
         </register>
