Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ2025DAR176.atdf
         <register caption="" name="IPC45" offset="0x410" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U5RXIS" />
            <bitfield mask="0x0000001C" name="U5RXIP" />
            <bitfield mask="0x00000300" name="U5TXIS" />
            <bitfield mask="0x00001C00" name="U5TXIP" />
            <bitfield mask="0x00030000" name="I2C5BIS" />
            <bitfield mask="0x001C0000" name="I2C5BIP" />
            <bitfield mask="0x03000000" name="I2C5SIS" />
            <bitfield mask="0x1C000000" name="I2C5SIP" />
         </register>
         <register caption="" name="IPC46" offset="0x420" rw="RW" size="4">
            <bitfield mask="0x00000003" name="I2C5MIS" />
            <bitfield mask="0x0000001C" name="I2C5MIP" />
            <bitfield mask="0x00000300" name="SPI6EIS" />
            <bitfield mask="0x00001C00" name="SPI6EIP" />
            <bitfield mask="0x00030000" name="SPI6RXIS" />
            <bitfield mask="0x001C0000" name="SPI6RXIP" />
            <bitfield mask="0x03000000" name="SPI6TXIS" />
            <bitfield mask="0x1C000000" name="SPI6TXIP" />
         </register>
         <register caption="" name="IPC47" offset="0x430" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U6EIS" />
            <bitfield mask="0x0000001C" name="U6EIP" />
            <bitfield mask="0x00000300" name="U6RXIS" />
            <bitfield mask="0x00001C00" name="U6RXIP" />
            <bitfield mask="0x00030000" name="U6TXIS" />
            <bitfield mask="0x001C0000" name="U6TXIP" />
            <bitfield mask="0x03000000" name="SDHCIS" />
            <bitfield mask="0x1C000000" name="SDHCIP" />
         </register>
         <register caption="" name="IPC48" offset="0x440" rw="RW" size="4">
            <bitfield mask="0x00000003" name="GLCDIS" />
            <bitfield mask="0x0000001C" name="GLCDIP" />
            <bitfield mask="0x00000300" name="GPUIS" />
            <bitfield mask="0x00001C00" name="GPUIP" />
            <bitfield mask="0x03000000" name="CTMUIS" />
            <bitfield mask="0x1C000000" name="CTMUIP" />
         </register>
         <register caption="" name="IPC49" offset="0x450" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCEOSIS" />
            <bitfield mask="0x0000001C" name="ADCEOSIP" />
            <bitfield mask="0x00000300" name="ADCARDYIS" />
            <bitfield mask="0x00001C00" name="ADCARDYIP" />
            <bitfield mask="0x00030000" name="ADCURDYIS" />
            <bitfield mask="0x001C0000" name="ADCURDYIP" />
            <bitfield mask="0x03000000" name="ADC0EIS" />
            <bitfield mask="0x1C000000" name="ADC0EIP" />
         </register>
         <register caption="" name="IPC50" offset="0x460" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADC1EIS" />
            <bitfield mask="0x0000001C" name="ADC1EIP" />
            <bitfield mask="0x00000300" name="ADC2EIS" />
            <bitfield mask="0x00001C00" name="ADC2EIP" />
            <bitfield mask="0x00030000" name="ADC3EIS" />
            <bitfield mask="0x001C0000" name="ADC3EIP" />
            <bitfield mask="0x03000000" name="ADC4EIS" />
            <bitfield mask="0x1C000000" name="ADC4EIP" />
         </register>
         <register caption="" name="IPC51" offset="0x470" rw="RW" size="4">
            <bitfield mask="0x00000300" name="ADCGRPEIS" />
            <bitfield mask="0x00001C00" name="ADCGRPEIP" />
            <bitfield mask="0x00030000" name="ADC7EIS" />
            <bitfield mask="0x001C0000" name="ADC7EIP" />
            <bitfield mask="0x03000000" name="ADC0WIS" />
            <bitfield mask="0x1C000000" name="ADC0WIP" />
         </register>
         <register caption="" name="IPC52" offset="0x480" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADC1WIS" />
            <bitfield mask="0x0000001C" name="ADC1WIP" />
            <bitfield mask="0x00000300" name="ADC2WIS" />
            <bitfield mask="0x00001C00" name="ADC2WIP" />
            <bitfield mask="0x00030000" name="ADC3WIS" />
            <bitfield mask="0x001C0000" name="ADC3WIP" />
            <bitfield mask="0x03000000" name="ADC4WIS" />
            <bitfield mask="0x1C000000" name="ADC4WIP" />
         </register>
         <register caption="" name="IPC53" offset="0x490" rw="RW" size="4">
            <bitfield mask="0x00030000" name="ADC7WIS" />
            <bitfield mask="0x001C0000" name="ADC7WIP" />
            <bitfield mask="0x03000000" name="MPLLFLTIS" />
            <bitfield mask="0x1C000000" name="MPLLFLTIP" />
         </register>
         <register caption="" name="OFF000" offset="0x540" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF001" offset="0x544" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF002" offset="0x548" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF003" offset="0x54c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF004" offset="0x550" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF005" offset="0x554" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF006" offset="0x558" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF007" offset="0x55c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF008" offset="0x560" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF009" offset="0x564" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF010" offset="0x568" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF011" offset="0x56c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
