Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ2025DAR176.atdf
         <register caption="" name="SBT7RD0" offset="0x10430" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT7RD0__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT7RD0__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT7RD0__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT7RD0__GROUP3" />
         </register>
         <register caption="" name="SBT7RD1" offset="0x10450" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT7RD1__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT7RD1__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT7RD1__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT7RD1__GROUP3" />
         </register>
         <register caption="" name="SBT7RD2" offset="0x10470" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT7RD2__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT7RD2__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT7RD2__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT7RD2__GROUP3" />
         </register>
         <register caption="" name="SBT8RD0" offset="0x10830" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT8RD0__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT8RD0__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT8RD0__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT8RD0__GROUP3" />
         </register>
         <register caption="" name="SBT8RD1" offset="0x10850" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT8RD1__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT8RD1__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT8RD1__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT8RD1__GROUP3" />
         </register>
         <register caption="" name="SBT9RD0" offset="0x10C30" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT9RD0__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT9RD0__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT9RD0__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT9RD0__GROUP3" />
         </register>
         <register caption="" name="SBT9RD1" offset="0x10C50" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT9RD1__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT9RD1__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT9RD1__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT9RD1__GROUP3" />
         </register>
         <register caption="" name="SBT10RD0" offset="0x11030" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT10RD0__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT10RD0__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT10RD0__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT10RD0__GROUP3" />
         </register>
         <register caption="" name="SBT10RD1" offset="0x11050" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT10RD1__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT10RD1__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT10RD1__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT10RD1__GROUP3" />
         </register>
         <register caption="" name="SBT11RD0" offset="0x11430" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT11RD0__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT11RD0__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT11RD0__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT11RD0__GROUP3" />
         </register>
         <register caption="" name="SBT11RD1" offset="0x11450" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT11RD1__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT11RD1__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT11RD1__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT11RD1__GROUP3" />
         </register>
         <register caption="" name="SBT12RD0" offset="0x11830" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT12RD0__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT12RD0__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT12RD0__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT12RD0__GROUP3" />
         </register>
         <register caption="" name="SBT13RD0" offset="0x20430" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT13RD0__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT13RD0__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT13RD0__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT13RD0__GROUP3" />
         </register>
         <register caption="" name="SBT13RD1" offset="0x20450" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT13RD1__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT13RD1__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT13RD1__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT13RD1__GROUP3" />
         </register>
         <register caption="" name="SBT14RD0" offset="0x20830" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT14RD0__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT14RD0__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT14RD0__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT14RD0__GROUP3" />
         </register>
